<template>
  <div class="landing-block landing-block-reviews">
        <default-slider :customClasses="sliderClasses">

            <reviewItem v-for="review in reviews" :key="review.name" :data="review" />

        </default-slider>
    </div>
</template>

<script>
import defaultSlider from '../sliders/defaultSlider.vue';
import reviewItem from './reviewsItem.vue';

export default {
    components: {
        defaultSlider,
        reviewItem
    },

    data () {
        return {
            reviews: [
                {
                    avatarSrc: 'images/home/reviews/1/avatar.png',
                    name: 'Михаил Шакин',
                    position: 'Интернет-предприниматель, автор блога shakin.ru | Курган',
                    achive: `
                        Уже 20 лет в интернет-бизнесе.
                        SEO-консультант и спикер ведущих конференций.
                        Обучил на своих курсах более тысячи SEO-специалистов.
                    `,

                    review: `
                        Клуб хорош тем, что здесь чувствуешь себя, как в кругу старых друзей. Все ребята адекватные, нет никаких троллей или токсичных личностей, которые могут отравлять общение.

                        Самое главное - у участников очень интересный и разнообразный опыт жизни и ведения бизнеса в самых разных сферах.

                        Плюс регулярно проводятся встречи клуба в разных городах и вебинары. Это расширяет кругозор и делает общение еще более интересным.

                        Администрация - большое спасибо за создание такой тёплой площадки! Искренне рекомендую!
                    `,
                },

                {
                    avatarSrc: 'images/home/reviews/2/avatar.png',
                    name: 'Елена Завьялова',
                    position: 'Цифровой коуч, вебмастер | Новосибирск',
                    achive: `
                        Прошла путь от фрилансера за 3 копейки и офисного сотрудника до своего онлайн-бизнеса на 1 млн./руб+.

                        Пережила депрессию. Несколько раз полностью меняла вектор развития.

                        Проехала как самостоятельный путешественник больше 10 стран.
                    `,

                    review: `
                        В движухе почти с самого начала, уже не помню сколько это в месяцах, но оно и не важно.

                        Клуб даёт мега-поддержку, когда ты весь такой современный онлайщик, интернет-предприниматель или фрилансер и сидишь работаешь из дома не особо общаясь с людьми в своей сфере в живую.

                        Здесь классный баланс между контентом и болталкой, а ещё между работой и развлечениями. Всегда можно пойти почитать опыт других ребят по схожим проектам, а можно поболтать в чатике о котиках.

                        На самом деле поддерживающее, безопасное окружение очень важно. Когда можно прийти и обсудить идеи по проекту или просто когда грустно и хочется поболтать о всяком. А если хочется прокачки скиллов - периодически устраиваются онлайн-созвоны (тоже можно хорошо пообщаться) и есть система наставничества.

                        Для меня Клуб - в первую очередь это классное, тёплое и уютное окружение, которого в моей работе часто не хватает.
                    `,
                },

                {
                    avatarSrc: 'images/home/reviews/3/avatar.png',
                    name: 'Андрей Буйлов',
                    position: 'Владелец интернет-агентства Муравейник, автор YuTube-канала SEO без воды, создатель биржи лидов dryleads.com | Уфа',
                    achive: `
                        Декан кафедры SEO в “GeekBrains”
                        Автор курса “Линкбилдинг” в “Нетологии”
                        Больше 19 лет в интернет-маркетинге и SEO
                        Больше > 1000 продвинутых сайтов, сотни рекламных кампаний в Яндекс-Директ, Google AdWords и социальных сетях
                        Доклады на конференциях Cybermarketing 2018-2019, Baltic Digital Days 2017-2020, SEO Conference 2016-2017, AllinTop 2020-2021, Dvoma.pro, BIT 2017, Ufa Digital Day 2016-2017, Формула сайта 2014,2015,2018, День интернет-продаж, День предпринимательства...
                    `,

                    review: `
                        Клуб просто огонь!

                        Общение, приватные публикации, стримы. И в то же время тёплое безопасное пространство, в котором можно обсуждать идеи и проекты без хейта.

                        Алексея знаю много лет, раз назвал клуб своим именем — будет делать максимально круто. Рекомендую, заходите и осваивайтесь!
                    `,
                },
            ],

            sliderClasses: ['reviews-slider'],
        }
    }
}
</script>

<style>

</style>
