SOROKIN_GROUPS = [
    "-1001799601598",  # Sorokin.Club Air
    "-1001528780757",  # Sorokin.Club - официальный канал клуба
    "-1001833784497",  # Флудилка
    "-1001638622431",  # Бадди
    "-1001530332058",  # Основной клубный чат
    "-1001666356890",  # Питерская туса
    "-1001558604188",  # Московская банда
    "-1001680488439",  # Новосибирская туса
    "-1001577139405",  # Нижегородская банда
    "-1002135035885",  # Казанская банда
    "-1001778257406",  # Самарско-Тольяттинская туса
    "-1001691567295",  # Ру СЕО
    "-1001658871586",  # Бурж СЕО
    "-1001876398974",  # Гедонизм
    "-1001643419411",  # Чат поддержки тех, кому тяжело
    "-1001334125094",  # Видео для бизнеса
    "-1001780211182",  # Совет клуба
    "-1001844417971",  # Позитив дня
    "-1001834798581",  # Женские секреты
    "-1001699179167",  # Качалочка
    "-1001957173579",  # Лидген
    "-1001892153463",  # Маркетплейсы
    "-1001533842924",  # Лига прогулок
    "-1001507366816",  # Инвесторский чат
    "-1001935732222",  # БДД
    "-1001837455693",  # Zettelkasten Sorokin.Club 
    "-1002010838055"  # for tests
]

